; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p18---int100n150-m25---int100c110---s571---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 level107 level108 level109 level110 - fuellevel
)

(:init
(sum level0 level6 level6)
(sum level0 level16 level16)
(sum level0 level24 level24)
(sum level0 level25 level25)
(sum level1 level6 level7)
(sum level1 level16 level17)
(sum level1 level24 level25)
(sum level1 level25 level26)
(sum level2 level6 level8)
(sum level2 level16 level18)
(sum level2 level24 level26)
(sum level2 level25 level27)
(sum level3 level6 level9)
(sum level3 level16 level19)
(sum level3 level24 level27)
(sum level3 level25 level28)
(sum level4 level6 level10)
(sum level4 level16 level20)
(sum level4 level24 level28)
(sum level4 level25 level29)
(sum level5 level6 level11)
(sum level5 level16 level21)
(sum level5 level24 level29)
(sum level5 level25 level30)
(sum level6 level6 level12)
(sum level6 level16 level22)
(sum level6 level24 level30)
(sum level6 level25 level31)
(sum level7 level6 level13)
(sum level7 level16 level23)
(sum level7 level24 level31)
(sum level7 level25 level32)
(sum level8 level6 level14)
(sum level8 level16 level24)
(sum level8 level24 level32)
(sum level8 level25 level33)
(sum level9 level6 level15)
(sum level9 level16 level25)
(sum level9 level24 level33)
(sum level9 level25 level34)
(sum level10 level6 level16)
(sum level10 level16 level26)
(sum level10 level24 level34)
(sum level10 level25 level35)
(sum level11 level6 level17)
(sum level11 level16 level27)
(sum level11 level24 level35)
(sum level11 level25 level36)
(sum level12 level6 level18)
(sum level12 level16 level28)
(sum level12 level24 level36)
(sum level12 level25 level37)
(sum level13 level6 level19)
(sum level13 level16 level29)
(sum level13 level24 level37)
(sum level13 level25 level38)
(sum level14 level6 level20)
(sum level14 level16 level30)
(sum level14 level24 level38)
(sum level14 level25 level39)
(sum level15 level6 level21)
(sum level15 level16 level31)
(sum level15 level24 level39)
(sum level15 level25 level40)
(sum level16 level6 level22)
(sum level16 level16 level32)
(sum level16 level24 level40)
(sum level16 level25 level41)
(sum level17 level6 level23)
(sum level17 level16 level33)
(sum level17 level24 level41)
(sum level17 level25 level42)
(sum level18 level6 level24)
(sum level18 level16 level34)
(sum level18 level24 level42)
(sum level18 level25 level43)
(sum level19 level6 level25)
(sum level19 level16 level35)
(sum level19 level24 level43)
(sum level19 level25 level44)
(sum level20 level6 level26)
(sum level20 level16 level36)
(sum level20 level24 level44)
(sum level20 level25 level45)
(sum level21 level6 level27)
(sum level21 level16 level37)
(sum level21 level24 level45)
(sum level21 level25 level46)
(sum level22 level6 level28)
(sum level22 level16 level38)
(sum level22 level24 level46)
(sum level22 level25 level47)
(sum level23 level6 level29)
(sum level23 level16 level39)
(sum level23 level24 level47)
(sum level23 level25 level48)
(sum level24 level6 level30)
(sum level24 level16 level40)
(sum level24 level24 level48)
(sum level24 level25 level49)
(sum level25 level6 level31)
(sum level25 level16 level41)
(sum level25 level24 level49)
(sum level25 level25 level50)
(sum level26 level6 level32)
(sum level26 level16 level42)
(sum level26 level24 level50)
(sum level26 level25 level51)
(sum level27 level6 level33)
(sum level27 level16 level43)
(sum level27 level24 level51)
(sum level27 level25 level52)
(sum level28 level6 level34)
(sum level28 level16 level44)
(sum level28 level24 level52)
(sum level28 level25 level53)
(sum level29 level6 level35)
(sum level29 level16 level45)
(sum level29 level24 level53)
(sum level29 level25 level54)
(sum level30 level6 level36)
(sum level30 level16 level46)
(sum level30 level24 level54)
(sum level30 level25 level55)
(sum level31 level6 level37)
(sum level31 level16 level47)
(sum level31 level24 level55)
(sum level31 level25 level56)
(sum level32 level6 level38)
(sum level32 level16 level48)
(sum level32 level24 level56)
(sum level32 level25 level57)
(sum level33 level6 level39)
(sum level33 level16 level49)
(sum level33 level24 level57)
(sum level33 level25 level58)
(sum level34 level6 level40)
(sum level34 level16 level50)
(sum level34 level24 level58)
(sum level34 level25 level59)
(sum level35 level6 level41)
(sum level35 level16 level51)
(sum level35 level24 level59)
(sum level35 level25 level60)
(sum level36 level6 level42)
(sum level36 level16 level52)
(sum level36 level24 level60)
(sum level36 level25 level61)
(sum level37 level6 level43)
(sum level37 level16 level53)
(sum level37 level24 level61)
(sum level37 level25 level62)
(sum level38 level6 level44)
(sum level38 level16 level54)
(sum level38 level24 level62)
(sum level38 level25 level63)
(sum level39 level6 level45)
(sum level39 level16 level55)
(sum level39 level24 level63)
(sum level39 level25 level64)
(sum level40 level6 level46)
(sum level40 level16 level56)
(sum level40 level24 level64)
(sum level40 level25 level65)
(sum level41 level6 level47)
(sum level41 level16 level57)
(sum level41 level24 level65)
(sum level41 level25 level66)
(sum level42 level6 level48)
(sum level42 level16 level58)
(sum level42 level24 level66)
(sum level42 level25 level67)
(sum level43 level6 level49)
(sum level43 level16 level59)
(sum level43 level24 level67)
(sum level43 level25 level68)
(sum level44 level6 level50)
(sum level44 level16 level60)
(sum level44 level24 level68)
(sum level44 level25 level69)
(sum level45 level6 level51)
(sum level45 level16 level61)
(sum level45 level24 level69)
(sum level45 level25 level70)
(sum level46 level6 level52)
(sum level46 level16 level62)
(sum level46 level24 level70)
(sum level46 level25 level71)
(sum level47 level6 level53)
(sum level47 level16 level63)
(sum level47 level24 level71)
(sum level47 level25 level72)
(sum level48 level6 level54)
(sum level48 level16 level64)
(sum level48 level24 level72)
(sum level48 level25 level73)
(sum level49 level6 level55)
(sum level49 level16 level65)
(sum level49 level24 level73)
(sum level49 level25 level74)
(sum level50 level6 level56)
(sum level50 level16 level66)
(sum level50 level24 level74)
(sum level50 level25 level75)
(sum level51 level6 level57)
(sum level51 level16 level67)
(sum level51 level24 level75)
(sum level51 level25 level76)
(sum level52 level6 level58)
(sum level52 level16 level68)
(sum level52 level24 level76)
(sum level52 level25 level77)
(sum level53 level6 level59)
(sum level53 level16 level69)
(sum level53 level24 level77)
(sum level53 level25 level78)
(sum level54 level6 level60)
(sum level54 level16 level70)
(sum level54 level24 level78)
(sum level54 level25 level79)
(sum level55 level6 level61)
(sum level55 level16 level71)
(sum level55 level24 level79)
(sum level55 level25 level80)
(sum level56 level6 level62)
(sum level56 level16 level72)
(sum level56 level24 level80)
(sum level56 level25 level81)
(sum level57 level6 level63)
(sum level57 level16 level73)
(sum level57 level24 level81)
(sum level57 level25 level82)
(sum level58 level6 level64)
(sum level58 level16 level74)
(sum level58 level24 level82)
(sum level58 level25 level83)
(sum level59 level6 level65)
(sum level59 level16 level75)
(sum level59 level24 level83)
(sum level59 level25 level84)
(sum level60 level6 level66)
(sum level60 level16 level76)
(sum level60 level24 level84)
(sum level60 level25 level85)
(sum level61 level6 level67)
(sum level61 level16 level77)
(sum level61 level24 level85)
(sum level61 level25 level86)
(sum level62 level6 level68)
(sum level62 level16 level78)
(sum level62 level24 level86)
(sum level62 level25 level87)
(sum level63 level6 level69)
(sum level63 level16 level79)
(sum level63 level24 level87)
(sum level63 level25 level88)
(sum level64 level6 level70)
(sum level64 level16 level80)
(sum level64 level24 level88)
(sum level64 level25 level89)
(sum level65 level6 level71)
(sum level65 level16 level81)
(sum level65 level24 level89)
(sum level65 level25 level90)
(sum level66 level6 level72)
(sum level66 level16 level82)
(sum level66 level24 level90)
(sum level66 level25 level91)
(sum level67 level6 level73)
(sum level67 level16 level83)
(sum level67 level24 level91)
(sum level67 level25 level92)
(sum level68 level6 level74)
(sum level68 level16 level84)
(sum level68 level24 level92)
(sum level68 level25 level93)
(sum level69 level6 level75)
(sum level69 level16 level85)
(sum level69 level24 level93)
(sum level69 level25 level94)
(sum level70 level6 level76)
(sum level70 level16 level86)
(sum level70 level24 level94)
(sum level70 level25 level95)
(sum level71 level6 level77)
(sum level71 level16 level87)
(sum level71 level24 level95)
(sum level71 level25 level96)
(sum level72 level6 level78)
(sum level72 level16 level88)
(sum level72 level24 level96)
(sum level72 level25 level97)
(sum level73 level6 level79)
(sum level73 level16 level89)
(sum level73 level24 level97)
(sum level73 level25 level98)
(sum level74 level6 level80)
(sum level74 level16 level90)
(sum level74 level24 level98)
(sum level74 level25 level99)
(sum level75 level6 level81)
(sum level75 level16 level91)
(sum level75 level24 level99)
(sum level75 level25 level100)
(sum level76 level6 level82)
(sum level76 level16 level92)
(sum level76 level24 level100)
(sum level76 level25 level101)
(sum level77 level6 level83)
(sum level77 level16 level93)
(sum level77 level24 level101)
(sum level77 level25 level102)
(sum level78 level6 level84)
(sum level78 level16 level94)
(sum level78 level24 level102)
(sum level78 level25 level103)
(sum level79 level6 level85)
(sum level79 level16 level95)
(sum level79 level24 level103)
(sum level79 level25 level104)
(sum level80 level6 level86)
(sum level80 level16 level96)
(sum level80 level24 level104)
(sum level80 level25 level105)
(sum level81 level6 level87)
(sum level81 level16 level97)
(sum level81 level24 level105)
(sum level81 level25 level106)
(sum level82 level6 level88)
(sum level82 level16 level98)
(sum level82 level24 level106)
(sum level82 level25 level107)
(sum level83 level6 level89)
(sum level83 level16 level99)
(sum level83 level24 level107)
(sum level83 level25 level108)
(sum level84 level6 level90)
(sum level84 level16 level100)
(sum level84 level24 level108)
(sum level84 level25 level109)
(sum level85 level6 level91)
(sum level85 level16 level101)
(sum level85 level24 level109)
(sum level85 level25 level110)
(sum level86 level6 level92)
(sum level86 level16 level102)
(sum level86 level24 level110)
(sum level87 level6 level93)
(sum level87 level16 level103)
(sum level88 level6 level94)
(sum level88 level16 level104)
(sum level89 level6 level95)
(sum level89 level16 level105)
(sum level90 level6 level96)
(sum level90 level16 level106)
(sum level91 level6 level97)
(sum level91 level16 level107)
(sum level92 level6 level98)
(sum level92 level16 level108)
(sum level93 level6 level99)
(sum level93 level16 level109)
(sum level94 level6 level100)
(sum level94 level16 level110)
(sum level95 level6 level101)
(sum level96 level6 level102)
(sum level97 level6 level103)
(sum level98 level6 level104)
(sum level99 level6 level105)
(sum level100 level6 level106)
(sum level101 level6 level107)
(sum level102 level6 level108)
(sum level103 level6 level109)
(sum level104 level6 level110)

(connected l0 l1)
(fuelcost level16 l0 l1)
(connected l0 l2)
(fuelcost level24 l0 l2)
(connected l1 l0)
(fuelcost level16 l1 l0)
(connected l1 l2)
(fuelcost level6 l1 l2)
(connected l1 l4)
(fuelcost level25 l1 l4)
(connected l2 l0)
(fuelcost level24 l2 l0)
(connected l2 l1)
(fuelcost level6 l2 l1)
(connected l2 l3)
(fuelcost level16 l2 l3)
(connected l2 l4)
(fuelcost level6 l2 l4)
(connected l3 l2)
(fuelcost level16 l3 l2)
(connected l3 l4)
(fuelcost level25 l3 l4)
(connected l4 l1)
(fuelcost level25 l4 l1)
(connected l4 l2)
(fuelcost level6 l4 l2)
(connected l4 l3)
(fuelcost level25 l4 l3)

(at t0 l0)
(fuel t0 level110)
(= (total-cost) 0)

(at p0 l0)
(at p1 l1)
(at p2 l2)
(at p3 l4)
(at p4 l4)
(at p5 l1)
(at p6 l1)
(at p7 l1)
(at p8 l0)
(at p9 l3)
(at p10 l4)
(at p11 l0)
(at p12 l4)
(at p13 l3)
(at p14 l0)
(at p15 l3)
(at p16 l2)
(at p17 l1)
)

(:goal
(and
(at p0 l3)
(at p1 l3)
(at p2 l4)
(at p3 l2)
(at p4 l2)
(at p5 l4)
(at p6 l4)
(at p7 l2)
(at p8 l2)
(at p9 l4)
(at p10 l3)
(at p11 l1)
(at p12 l0)
(at p13 l2)
(at p14 l2)
(at p15 l2)
(at p16 l4)
(at p17 l3)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p8 t0 l0)
   deleted: (at p8 l0)
   added: (in p8 t0)
   goals met: 0 of 18
2. (load p14 t0 l0)
   deleted: (at p14 l0)
   added: (in p14 t0)
   goals met: 0 of 18
3. (load p11 t0 l0)
   deleted: (at p11 l0)
   added: (in p11 t0)
   goals met: 0 of 18
4. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 0 of 18
5. (drive t0 l0 l1 level94 level16 level110)
   deleted: (at t0 l0) (fuel t0 level110)
   added: (at t0 l1) (fuel t0 level94)
   goals met: 0 of 18
6. (unload p11 t0 l1)
   deleted: (in p11 t0)
   added: (at p11 l1)
   goals met: 1 of 18
7. (load p7 t0 l1)
   deleted: (at p7 l1)
   added: (in p7 t0)
   goals met: 1 of 18
8. (load p6 t0 l1)
   deleted: (at p6 l1)
   added: (in p6 t0)
   goals met: 1 of 18
9. (load p5 t0 l1)
   deleted: (at p5 l1)
   added: (in p5 t0)
   goals met: 1 of 18
10. (load p17 t0 l1)
   deleted: (at p17 l1)
   added: (in p17 t0)
   goals met: 1 of 18
11. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 1 of 18
12. (drive t0 l1 l2 level88 level6 level94)
   deleted: (at t0 l1) (fuel t0 level94)
   added: (at t0 l2) (fuel t0 level88)
   goals met: 1 of 18
13. (unload p8 t0 l2)
   deleted: (in p8 t0)
   added: (at p8 l2)
   goals met: 2 of 18
14. (unload p7 t0 l2)
   deleted: (in p7 t0)
   added: (at p7 l2)
   goals met: 3 of 18
15. (unload p14 t0 l2)
   deleted: (in p14 t0)
   added: (at p14 l2)
   goals met: 4 of 18
16. (load p2 t0 l2)
   deleted: (at p2 l2)
   added: (in p2 t0)
   goals met: 4 of 18
17. (load p16 t0 l2)
   deleted: (at p16 l2)
   added: (in p16 t0)
   goals met: 4 of 18
18. (drive t0 l2 l4 level82 level6 level88)
   deleted: (at t0 l2) (fuel t0 level88)
   added: (at t0 l4) (fuel t0 level82)
   goals met: 4 of 18
19. (load p10 t0 l4)
   deleted: (at p10 l4)
   added: (in p10 t0)
   goals met: 4 of 18
20. (drive t0 l4 l3 level57 level25 level82)
   deleted: (at t0 l4) (fuel t0 level82)
   added: (at t0 l3) (fuel t0 level57)
   goals met: 4 of 18
21. (load p13 t0 l3)
   deleted: (at p13 l3)
   added: (in p13 t0)
   goals met: 4 of 18
22. (load p15 t0 l3)
   deleted: (at p15 l3)
   added: (in p15 t0)
   goals met: 4 of 18
23. (load p9 t0 l3)
   deleted: (at p9 l3)
   added: (in p9 t0)
   goals met: 4 of 18
24. (unload p0 t0 l3)
   deleted: (in p0 t0)
   added: (at p0 l3)
   goals met: 5 of 18
25. (unload p1 t0 l3)
   deleted: (in p1 t0)
   added: (at p1 l3)
   goals met: 6 of 18
26. (unload p10 t0 l3)
   deleted: (in p10 t0)
   added: (at p10 l3)
   goals met: 7 of 18
27. (unload p17 t0 l3)
   deleted: (in p17 t0)
   added: (at p17 l3)
   goals met: 8 of 18
28. (drive t0 l3 l4 level32 level25 level57)
   deleted: (at t0 l3) (fuel t0 level57)
   added: (at t0 l4) (fuel t0 level32)
   goals met: 8 of 18
29. (load p12 t0 l4)
   deleted: (at p12 l4)
   added: (in p12 t0)
   goals met: 8 of 18
30. (load p3 t0 l4)
   deleted: (at p3 l4)
   added: (in p3 t0)
   goals met: 8 of 18
31. (load p4 t0 l4)
   deleted: (at p4 l4)
   added: (in p4 t0)
   goals met: 8 of 18
32. (unload p16 t0 l4)
   deleted: (in p16 t0)
   added: (at p16 l4)
   goals met: 9 of 18
33. (unload p2 t0 l4)
   deleted: (in p2 t0)
   added: (at p2 l4)
   goals met: 10 of 18
34. (unload p5 t0 l4)
   deleted: (in p5 t0)
   added: (at p5 l4)
   goals met: 11 of 18
35. (unload p6 t0 l4)
   deleted: (in p6 t0)
   added: (at p6 l4)
   goals met: 12 of 18
36. (unload p9 t0 l4)
   deleted: (in p9 t0)
   added: (at p9 l4)
   goals met: 13 of 18
37. (drive t0 l4 l2 level26 level6 level32)
   deleted: (at t0 l4) (fuel t0 level32)
   added: (at t0 l2) (fuel t0 level26)
   goals met: 13 of 18
38. (unload p13 t0 l2)
   deleted: (in p13 t0)
   added: (at p13 l2)
   goals met: 14 of 18
39. (unload p15 t0 l2)
   deleted: (in p15 t0)
   added: (at p15 l2)
   goals met: 15 of 18
40. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 16 of 18
41. (unload p4 t0 l2)
   deleted: (in p4 t0)
   added: (at p4 l2)
   goals met: 17 of 18
42. (drive t0 l2 l0 level2 level24 level26)
   deleted: (at t0 l2) (fuel t0 level26)
   added: (at t0 l0) (fuel t0 level2)
   goals met: 17 of 18
43. (unload p12 t0 l0)
   deleted: (in p12 t0)
   added: (at p12 l0)
   goals met: 18 of 18
